Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/G73B.tmx
Source language: en_us
Languages: zh_cn

source: My father
zh_cn: 我的父亲

source: My father was a self-taught mandolin player. He was one of the best string instrument players in our town.
zh_cn: 我父亲是个自学成才的曼陀林琴手，他是我们镇最优秀的弦乐演奏者之一。

source: He could not read music, but if he heard a tune a few times, he could play it.
zh_cn: 他看不懂乐谱，但是如果听几次曲子，他就能演奏出来。

source: When he was younger, he was a member of a small country music band.
zh_cn: 当他年轻一点的时候，他是一个小乡村乐队的成员。

source: They would play at local dances and on a few occasions would play for the local radio station.
zh_cn: 他们在当地舞厅演奏，有几次还为当地广播电台演奏。

source: He often told us how he had auditioned and earned a position in a band that featured Patsy Cline as their lead singer.
zh_cn: 他经常告诉我们，自己如何试演，如何在佩茜克莱恩作为主唱的乐队里占一席之位。

source: He told the family that after he was hired he never went back.
zh_cn: 他告诉家人，一旦被聘用就永不回头。

source: Dad was a very religious man. He stated that there was a lot of drinking and cursing the day of his audition and he did not want to be around that type of environment.
zh_cn: 父亲是一个很严谨的人，他讲述了他试演的那天，很多人在喝酒，咒骂，他不想呆在那种环境里。

source: Occasionally, Dad would get out his mandolin and play for the family.
zh_cn: 偶尔地，爸爸会拿出他的曼陀林，为家人演奏。

source: We three children: Trisha, Monte and I, George Jr., would often sing along. Songs such as the Tennessee Waltz, Harbor Lights and around Christmas time, the well-known rendition of Silver Bells.
zh_cn: 我们家一共有三个孩子：特丽莎，蒙特，和我，小乔治常常一个人唱歌，如田纳西华尔兹，夕阳下的赤帆，在圣诞期间，还有著名的叮叮当。

source: "Silver Bells, Silver Bells, its Christmas time in the city" would ring throughout the house.
zh_cn: “叮叮当，叮叮当，圣诞来临了”的歌声响彻屋子。

source: One of Dad's favorite hymns was "The Old Rugged Cross".
zh_cn: 爸爸最喜欢的歌就是“古旧十架”。

source: We learned the words to the hymn when we were very young, and would sing it with Dad when he would play and sing.
zh_cn: 我们很小的时候，就知道了这首歌，和爸爸一起演奏歌唱。

source: Another song that was often shared in our house was a song that accompanied the Walt Disney series: Davey Crockett.
zh_cn: 我们常唱的另一首歌就是华特迪士尼精选系列：戴维·克罗克特。

source: Dad only had to hear the song twice before he learned it well enough to play it.
zh_cn: 爸爸在学会这首歌之前，只听过这首歌两次。

source: "Davey, Davey Crockett, King of the Wild Frontier" was a favorite song for the family.
zh_cn: “戴维，戴维克罗克特，荒野边疆的国王”是我们家最喜欢的歌。

source: He knew we enjoyed the song and the program and would often get out the mandolin after the program was over.
zh_cn: 他知道我们很喜欢这首歌，所以通常在曼陀林演奏完之后，就是这个节目。

source: I could never get over how he could play the songs so well after only hearing them a few times.
zh_cn: 我永远也想不出他怎么能在只听过几遍就能把曲子弹得如此好。

source: I loved to sing, but I never learned how to play the mandolin.
zh_cn: 我喜欢唱歌，但是我从来没有学过如何弹奏曼陀林。

source: This is something I regret to this day.
zh_cn: 这是我的遗憾。

source: Dad loved to play the mandolin for his family he knew we enjoyed singing, and hearing him play.
zh_cn: 爸爸喜欢为家人弹奏曼陀林，他知道我们喜欢唱歌，喜欢听他弹奏。

source: He was like that.
zh_cn: 他喜欢这样。

source: If he could give pleasure to others, he would, especially his family.
zh_cn: 只要能给他人带来快乐，尤其是他的家人，他就去做。

source: He was always there, sacrificing his time and efforts to see that his family had enough in their life.
zh_cn: 他总是那样，牺牲自己的时间和精力让家人生活的满足。

source: I had to mature into a man and have children of my own before I realized how much he had sacrificed.
zh_cn: 父亲的这种付出是只有当我长大成人，而且是有了自己的孩子后才能体会到的。

source: I joined the United States Air Force in January of 1962.
zh_cn: 1962年1月我参加了美国空军。

source: Whenever I would come home on leave, I would ask Dad to play the mandolin.
zh_cn: 每当我休假回家，我都会让爸爸弹奏曼陀林。

source: Nobody played the mandolin like my father. He could touch your soul with the tones that came out of that old mandolin.
zh_cn: 没有人弹奏曼陀林能达到像我父亲那样的境界，他在那古老的曼陀林上抚出的旋律能够触及你的灵魂。

source: He seemed to shine when he was playing.
zh_cn: 他弹奏的时候，身上似乎能发出四射的光芒。

source: You could see his pride in his ability to play so well for his family.
zh_cn: 你可以看出，父亲为能给家人弹奏出如此美妙的旋律，他是多么的自豪。

source: When Dad was younger, he worked for his father on the farm.
zh_cn: 父亲年轻的时候，曾在农场为爷爷工作。

source: His father was a farmer and sharecropped a farm for the man who owned the property.
zh_cn: 爷爷租用农场，要向农场主人交纳谷物抵租。

source: In 1950, our family moved from the farm. Dad had gained employment at the local limestone quarry.
zh_cn: 1950年，我们全家搬离农场，父亲在当地石灰石采石场谋得职位。

source: When the quarry closed in August of 1957, he had to seek other employment.
zh_cn: 采石场在1957年倒闭，他只好另觅工作。

source: He worked for Owens Yacht Company in Dundalk, Maryland and for Todd Steel in Point of Rocks, Maryland.
zh_cn: 他曾在马里兰州登多克的欧文斯游艇公司上班，还在马里兰州的洛斯的托德钢铁公司上过班。

source: While working at Todd Steel, he was involved in an accident.
zh_cn: 而工作在托德钢，他被卷入了一场事故。

source: His job was to roll angle iron onto a conveyor so that the welders farther up the production line would have it to complete their job.
zh_cn: 他的工作是把有棱角的铁滚到搬运台上，这样焊接工才能作进一步加工来完成整个工序。

source: On this particular day Dad got the third index finger of his left hand mashed between two pieces of steel.
zh_cn: 突然有一天，父亲的左手第三个手指被夹在两片钢铁中。

source: The doctor who operated on the finger could not save it, and Dad ended up having the tip of the finger amputated.
zh_cn: 医生对手指施手术，但未能保住那只手指，最后父亲只好让医生把那手指的指尖给切除了。

source: He didn't lose enough of the finger where it would stop him picking up anything, but it did impact his ability to play the mandolin.
zh_cn: 那个手指并没有完全丧失拿东西的能力，但是却影响了他弹奏曼陀林的能力。

source: After the accident, Dad was reluctant to play the mandolin.
zh_cn: 那件事之后，爸爸不愿再弹曼陀林了。

source: He felt that he could not play as well as he had before the accident.
zh_cn: 他认为他弹得不能像以前一样好了。

source: When I came home on leave and asked him to play he would make excuses for why he couldn't play.
zh_cn: 当我休假回家，让父亲弹奏时，他总是找各种各样的理由拒绝。

source: Eventually, we would wear him down and he would say "Okay, but remember, I can't hold down on the strings the way I used to" or "Since the accident to this finger I can't play as good".
zh_cn: 最终，我们会说服他，他会说“好吧，但是记住，我不能像以前那样弹了”或者“那场事故后，那根手指弹得不像以前一样好了”。

source: For the family it didn't make any difference that Dad couldn't play as well. We were just glad that he would play.
zh_cn: 对于家人来说，父亲弹得好不好并没有分别，我们很高兴他终于弹奏了。

source: When he played the old mandolin it would carry us back to a cheerful, happier time in our lives.
zh_cn: 当他弹起那把陈旧的曼陀林，就会把我们带回昔日那些无忧无虑的幸福时光。

source: "Davey, Davey Crockett, King of the Wild Frontier", would again be heard in the little town of Bakerton, West Virginia.
zh_cn: “戴维，戴维克罗克特，荒野边疆的国王”就会再次响彻西弗吉尼亚州的贝克顿小镇。

source: In August of 1993 my father was diagnosed with inoperable lung cancer.
zh_cn: 1993年8月，我父亲被确诊为不能动手术的肺癌。

source: He chose not to receive chemotherapy treatments so that he could live out the rest of his life in dignity.
zh_cn: 他不想接受化疗，因为他想体面地过完他生命最后的时光。

source: About a week before his death, we asked Dad if he would play the mandolin for us.
zh_cn: 他去世前一周，我们问爸爸是否能为我们弹奏曼陀林。

source: He knew it would probably be the last time he would play for us. He tuned up the old mandolin and played a few notes.
zh_cn: 他知道这可能是他最后一次为我们弹奏了，他为老曼陀林调弦，弹了几个音。

source: When I looked around, there was not a dry eye in the family.
zh_cn: 当我放眼望去，我们家人都泪流满面。

source: We saw before us a quiet humble man with an inner strength that comes from knowing God, and living with him in one's life.
zh_cn: 我们看见，在我们面前的是一个安静、谦虚的人，用生命中最后的力量，用爱支撑着。

source: Dad would never play the mandolin for us again.
zh_cn: 爸爸再也不会为我们弹曼陀林。

source: We felt at the time that he wouldn't have enough strength to play, and that makes the memory of that day even stronger.
zh_cn: 那时，我们感觉他已经没有足够的力量，为我们弹奏，这让我们的记忆更加深刻。

source: Dad was doing something he had done all his life, giving.
zh_cn: 父亲的一生都在做的事情：奉献。

source: As sick as he was, he was still pleasing others.
zh_cn: 即使生病，他还在取悦他人。

source: Dad sure could play that Mandolin!
zh_cn: 爸爸绝对是在谱写曼陀林的真谛！
